In [1]:
import pandas as pd

In [2]:
dados = pd.read_csv('dados/aluguel.csv', sep = ';')
dados.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento
1,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,16.67,Apartamento
2,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,26.00,Apartamento
3,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,21.43,Apartamento
4,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,16.67,Apartamento

In [3]:
classes = [0,2,4,6,100]

In [4]:
quartos = pd.cut(dados.Quartos, classes)

In [5]:
pd.value_counts(quartos)

(0, 2]      11074
(2, 4]       8094
(4, 6]        470
(6, 100]       36
Name: Quartos, dtype: int64

In [6]:
labels = ['1 e 2 Quartos', '3 e 4 Quartos', '5 e 6 Quartos', '7 ou mais Quartos']

In [8]:
quartos = pd.cut(dados.Quartos, classes, labels = labels, include_lowest = True)

In [9]:
pd.value_counts(quartos)

1 e 2 Quartos        11231
3 e 4 Quartos         8094
5 e 6 Quartos          470
7 ou mais Quartos       36
Name: Quartos, dtype: int64